package cmd

import (
	"fmt"
	"os"

	"github.com/spf13/cobra"
)

var rootCmd = &cobra.Command{
	Use:   "koolbase",
	Short: "Koolbase CLI — manage your Koolbase project from the terminal",
	Long: `
██╗  ██╗ ██████╗  ██████╗ ██╗     ██████╗  █████╗ ███████╗███████╗
██║ ██╔╝██╔═══██╗██╔═══██╗██║     ██╔══██╗██╔══██╗██╔════╝██╔════╝
█████╔╝ ██║   ██║██║   ██║██║     ██████╔╝███████║███████╗█████╗
██╔═██╗ ██║   ██║██║   ██║██║     ██╔══██╗██╔══██║╚════██║██╔══╝
██║  ██╗╚██████╔╝╚██████╔╝███████╗██████╔╝██║  ██║███████║███████╗
╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚══════╝╚═════╝ ╚═╝  ╚═╝╚══════╝╚══════╝

Backend as a Service for mobile developers.
Docs: https://docs.koolbase.com
`,
}

func Execute() {
	if err := rootCmd.Execute(); err != nil {
		fmt.Fprintln(os.Stderr, err)
		os.Exit(1)
	}
}

func init() {
	rootCmd.AddCommand(loginCmd)
	rootCmd.AddCommand(deployCmd)
	rootCmd.AddCommand(invokeCmd)
	rootCmd.AddCommand(logsCmd)
	rootCmd.AddCommand(functionsCmd)
	rootCmd.AddCommand(cronsCmd)
	rootCmd.AddCommand(bundleCmd)
	rootCmd.AddCommand(pushCmd)
}
